Repository: PabloCastellano/plugin-sitemap_generator
Catalog: sitemap_generator/languages/*/messages.po
Languages: es_es

source: Sitemap Generator Help
es_es: Ayuda Sitemap Generator

source: Sitemap.xml generated correctly
es_es: Sitemap.xml generador correctamente

source: What is Sitemap Generator Plugin?
es_es: ¿Qué es el plugin Sitemap Generator?

source: Sitemap Generator plugin allows you to generate a sitemap.xml file and ping the major search engines so they will be able to index your site
es_es: El plugin Sitemap Generator le permite generar un archivo sitemap.xml y enviarlo a los más conocidos motores de búsqueda para que puedan indexar tu sitio web

source: How does Sitemap Generator plugin work?
es_es: ¿Cómo funciona el plugin Sitemap Generator?

source: The plugin will generate a sitemap.xml file on the root of your OSClass installation. The folder <b>must have write permissions</b> to work correctly. The sitemap.xml file will be generated hourly and at the same time will ping the major search engines. No user interaction is needed
es_es: El plugin generará un archivo sitemap.xml en la raíz de la instalación de OSClass. La carpeta <b>debe tener permisos de escritura</b> para que funcione correctamente. El archivo sitemap.xml se regenerará cada hora y a la vez se enviará a los más conocidos motores de búsqueda. No se necesita interacción del usuario

source: How do I generate sitemaps manually?
es_es: ¿Cómo genero sitemaps manualmente?

source: Sitemap file generation could take some resources and time depending on how big your website is. We strongly suggest to run it manually via a system's cron. To achieve that, you should modify index.php file, and comment or remove tha last line (osc_add_hook('cron_daily', 'sitemap_generator');) and run manual_cron.php instead on your system's cron
es_es: La generación del archivo sitemaps puede consumir más o menos tiempo y recursos dependiendo de lo grande que sea su sitio web. Recomendamos encarecidamente ejecutarlo manualmente con el cron del sistema. Para hacerlo, debes modificar el archivo index.php y comentar o quitar la última línea (osc_add_hook('cron_daily', 'sitemap_generator');) y ejecutar manual_cron.php mediante cron

source: Sitemap Help
es_es: Ayuda Sitemap

source: Generate sitemap
es_es: Generar sitemap.xml
